#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include <libxml/xmlreader.h>
#include "xml.h"

/*
 * https://www.ti.com/tool/CCSTUDIO
 */

const char * const TITLE = "com.ti.ccstudio";
const char * const TITLE_buildDefinitions = "com.ti.ccstudio.buildDefinitions";
const char * const settings = "org.eclipse.cdt.core.settings";
const char * const builder = "builder";
const char * const tool = "tool";
const char * const project = "project";
const char * const sourceEntries = "sourceEntries";
const char * const entry = "entry";
const char * const XmlProjectDescriptionStorage = "org.eclipse.cdt.core.XmlProjectDescriptionStorage";
const char * const targetPlatform = "targetPlatform";
const char * const listOptionValue = "listOptionValue";
const char * const inputType = "inputType";
//const char * const enumerated = "enumerated";
const char * const includePath = "includePath";
const char * const includeFiles = "includeFiles";
const char * const libPaths = "libPaths";
const char * const libs = "libs";
const char * const definedSymbols = "definedSymbols";
const char * const boolean = "boolean";
const char * const stringList = "stringList";
const char * const string = "string";
//const char * const storageModule = "storageModule";
const char * const cconfiguration = "cconfiguration";
const char * const configuration = "configuration";
const char * const externalSettings = "externalSettings";
const char * const extensions = "extensions";
const char * const extension = "extension";
const char * const cdtBuildSystem = "cdtBuildSystem";
const char * const folderInfo = "folderInfo";
const char * const toolChain = "toolChain";
//const char * const option = "option";
const char * const org_eclipse_cdt_core = "org.eclipse.cdt.core";
const char * const org_eclipse_cdt_core_BinaryParser = "org.eclipse.cdt.core.BinaryParser";
const char * const org_eclipse_cdt_core_ErrorParser = "org.eclipse.cdt.core.ErrorParser";
const char * const com_ti_ccstudio_binaryparser_CoffParser = "com.ti.ccstudio.binaryparser.CoffParser";
const char * const org_eclipse_cdt_core_GmakeErrorParser = "org.eclipse.cdt.core.GmakeErrorParser";
const char * const com_ti_ccstudio_errorparser_CoffErrorParser = "com.ti.ccstudio.errorparser.CoffErrorParser";
const char * const com_ti_ccstudio_errorparser_AsmErrorParser = "com.ti.ccstudio.errorparser.AsmErrorParser";
const char * const com_ti_ccstudio_errorparser_LinkErrorParser = "com.ti.ccstudio.errorparser.LinkErrorParser";
const char * const configurationDataProvider = "org.eclipse.cdt.managedbuilder.core.configurationDataProvider";

const char * const fpMode[] = {
    ".relaxed",
    ".strict",
    NULL,
};

const char * const optForSpeed[] = {
    ".0",
    ".1",
    ".2",
    ".3",
    ".4",
    ".5",
    NULL,
};

const char * const optLevels[] = {
    ".0",
    ".1",
    ".2",
    ".3",
    ".4",
    NULL,
};

const char * const floatSupports[] = {
    ".VFPv2",
    ".VFPv3",
    ".VFPv3D16",
    ".FPv4SPD16",
    NULL,
};

const char * const ABIs[] = {
    ".eabi",
    NULL,
};

const char * const codeStates[] = {
    "16",
    "32",
    NULL,
};

const char * const siliconVersionsMSP430[] = {
    "mspx",
    NULL,
};

const char * const siliconVersionsARM[] = {
    ".4",
    ".5e",
    ".6",
    ".6M0",
    ".7A8",
    ".7M3",
    ".7M4",
    ".7R4",
    ".7R5",
    NULL,
};

typedef union {
    struct {
        uint32_t settings                  : 1;    // 0
        uint32_t cdtBuildSystem            : 1;    // 1
    } bits;
    uint32_t dword;
} cproject_has_t;

typedef enum {
    /*  0 */ CPROJECT_STATE_NONE = 0,
    /*  1 */ CPROJECT_STATE_CDT_SETTINGS,
    /*  2 */ CPROJECT_STATE_CCONFIGURATION,
    /*  3 */ CPROJECT_STATE_CCONFIGURATION_SETTINGS,
    /*  4 */ CPROJECT_STATE_EXTENSIONS,
    /*  5 */ CPROJECT_STATE_STORAGEMODULE_CDTBUILDSYSTEM,
    /*  6 */ CPROJECT_STATE_CONFIGURATION,
    /*  7 */ CPROJECT_STATE_FOLDERINFO,
    /*  8 */ CPROJECT_STATE_TOOLCHAIN,
    /*  9 */ CPROJECT_STATE_LISTOPTIONVALUE,
    /* 10 */ CPROJECT_STATE_TOOL_COMPILER,
    /* 11 */ CPROJECT_STATE_TOOL_LINKER,
    /* 12 */ CPROJECT_STATE_TOOL_HEX,
    /* 13 */ CPROJECT_STATE_SOURCEENTRIES,
} cproject_state_e;


typedef union {
    struct {
        uint32_t settings                  : 1; // 0
        uint32_t externalSettings          : 1; // 1
        uint32_t CoffParser                : 1; // 2
        uint32_t GmakeErrorParser          : 1; // 3
        uint32_t CoffErrorParser           : 1; // 4
        uint32_t AsmErrorParser            : 1; // 5
        uint32_t LinkErrorParser           : 1; // 6
        uint32_t configuration             : 1; // 7
        uint32_t folderInfo                : 1; // 8
        uint32_t toolChain                 : 1; // 9
        uint32_t targetTool                : 1; // 10
        uint32_t OPT_TAGS                  : 1; // 11
        uint32_t OPT_CODEGEN_VERSION       : 1; // 12
        uint32_t targetPlatform            : 1; // 13
        uint32_t configurationDataProvider : 1; // 14
        uint32_t builder                   : 1; // 15
        uint32_t tool_compiler             : 1; // 16
        uint32_t SILICON_VERSION           : 1; // 17
        uint32_t CODE_STATE                : 1; // 18
        uint32_t ABI                       : 1; // 19
        uint32_t DEFINE                    : 1; // 20
        uint32_t INCLUDE_PATH              : 1; // 21
        uint32_t DEBUGGING_MODEL           : 1; // 22
        uint32_t tool_linker               : 1; // 23
        uint32_t tool_hex                  : 1; // 24
        uint32_t inputType__C_SRCS         : 1; // 25
        uint32_t inputType__CPP_SRCS       : 1; // 26
        uint32_t inputType__ASM_SRCS       : 1; // 27
        uint32_t inputType__ASM2_SRCS      : 1; // 28
        uint32_t inputType__CMD_SRCS       : 1; // 29
        uint32_t inputType__CMD2_SRCS      : 1; // 30
        uint32_t inputType__GEN_CMDS       : 1; // 31
    } bits;
    uint32_t dword;
} cconfiguration_has_t;

const char * const MSP432 = "MSP432";
const char * const MSP430 = "MSP430";
typedef enum {
    ARCH_NONE = 0,
    ARCH_MSP430,
    ARCH_ARM,
} arch_t;

cproject_has_t cproject_has;
#define CPROJECT_DEPTH       12
cproject_state_e cproject_state[CPROJECT_DEPTH];
char storageModuleId[CPROJECT_DEPTH][128];
char cconfiguration_id[128];
char cconfiguration_targetTool[128];
char cconfiguration_name[32];

void print_cconfiguration_missing(cconfiguration_has_t _cch, uint32_t expected)
{
    cconfiguration_has_t failed;

    failed.dword = _cch.dword ^ expected;

    printf("fail: ");
    if (failed.bits.settings)
        printf("settings ");
    if (failed.bits.externalSettings)
        printf("externalSettings ");
    if (failed.bits.CoffParser)
        printf("CoffParser ");
    if (failed.bits.GmakeErrorParser)
        printf("GmakeErrorParser ");
