#include <string.h>
#include <stdbool.h>
#include <libxml/xmlreader.h>
#include "xml.h"

const char * const TITLE = "com.st.stm32cube.ide.mcu.gnu.managedbuild";
const char * const TITLE_OPTION = "com.st.stm32cube.ide.mcu.option";    // only for toolchain.version?
const char * const settings = "org.eclipse.cdt.core.settings";
const char * const LanguageSettingsProviders = "org.eclipse.cdt.core.LanguageSettingsProviders";
const char * const string = "string";
const char * const stringList = "stringList";
const char * const boolean = "boolean";
const char * const enumerated = "enumerated";
const char * const extensions = "extensions";
const char * const extension = "extension";
const char * const folderInfo = "folderInfo";
const char * const toolChain = "toolChain";
const char * const refreshScope = "refreshScope";
const char * const storageModule = "storageModule";
const char * const tool = "tool";
const char * const useByScannerDiscovery = "useByScannerDiscovery";
const char * const targetPlatform = "targetPlatform";
const char * const builder = "builder";
const char * const entry = "entry";
const char * const option = "option";
const char * const inputType = "inputType";
const char * const listOptionValue = "listOptionValue";
const char * const additionalInput = "additionalInput";
const char * const toolchain_exe = "toolchain.exe"; // was toolchain_gnu_cross_exe 
const char * const internal_toolchain_type = "internal.toolchain.type";

const char * const tool_assembler_option_includefiles = "tool.assembler.option.includefiles";
const char * const tool_assembler_option_otherflags = "tool.assembler.option.otherflags";
const char * const tool_assembler_input = "tool.assembler.input";
const char * const tool_c_compiler = "tool.c.compiler";

const char * const tool_c_compiler_option = "tool.c.compiler.option";
const char * const tool_c_compiler_input_c= "tool.c.compiler.input.c";
const char * const tool_cpp_compiler = "tool.cpp.compiler";
const char * const tool_cpp_compiler_option_debuglevel = "tool.cpp.compiler.option.debuglevel";
const char * const tool_cpp_compiler_option_optimization_level = "tool.cpp.compiler.option.optimization.level";
const char * const tool_c_linker = "tool.c.linker";
const char * const tool_c_linker_option = "tool.c.linker.option";
const char * const tool_c_linker_input = "tool.c.linker.input";
const char * const tool_cpp_linker = "tool.cpp.linker";
const char * const tool_cpp_linker_option_script = "tool.cpp.linker.option.script";
const char * const tool_cpp_linker_input = "tool.cpp.linker.input";
const char * const tool_archiver = "tool.archiver";
const char * const tool_size = "tool.size";
const char * const tool_objdump_listfile = "tool.objdump.listfile";
const char * const tool_objcopy_hex = "tool.objcopy.hex";
const char * const tool_objcopy_binary = "tool.objcopy.binary";
const char * const tool_objcopy_verilog = "tool.objcopy.verilog";
const char * const tool_objcopy_srec = "tool.objcopy.srec";
const char * const tool_objcopy_symbolsrec = "tool.objcopy.symbolsrec";
const char * const core_externalSettings = "org.eclipse.cdt.core.externalSettings";
const char * const org_eclipse_cdt_core_BinaryParser = "org.eclipse.cdt.core.BinaryParser";
const char * const org_eclipse_cdt_core_ErrorParser = "org.eclipse.cdt.core.ErrorParser";
const char * const org_eclipse_cdt_core_ELF = "org.eclipse.cdt.core.ELF";
const char * const org_eclipse_cdt_core_GASErrorParser = "org.eclipse.cdt.core.GASErrorParser";
const char * const org_eclipse_cdt_core_GmakeErrorParser = "org.eclipse.cdt.core.GmakeErrorParser";
const char * const org_eclipse_cdt_core_GLDErrorParser = "org.eclipse.cdt.core.GLDErrorParser";
const char * const org_eclipse_cdt_core_CWDLocator = "org.eclipse.cdt.core.CWDLocator";
const char * const org_eclipse_cdt_core_GCCErrorParser = "org.eclipse.cdt.core.GCCErrorParser";
const char * const buildtargets = "org.eclipse.cdt.make.core.buildtargets";
const char * const cdtBuildSystem = "cdtBuildSystem";
const char * const scannerConfiguration = "scannerConfiguration";
const char * const scannerConfigBuildInfo = "scannerConfigBuildInfo";
const char * const autodiscovery = "autodiscovery";
const char * const cconfiguration = "cconfiguration";
const char * const configuration = "configuration";
const char * const sourceEntries = "sourceEntries";
const char * const configurationDataProvider = "org.eclipse.cdt.managedbuilder.core.configurationDataProvider";
const char * const externalSettings = "externalSettings";


struct node_s {
    void *ptr;
    struct node_s *next;
};

typedef struct {
    char config_gnu_cross_exe[96];
    char config_gnu_cross_exe_folderInfo[96];
    char tool_gnu_cross_c_compiler[96];
    char tool_gnu_cross_c_compiler_input[96];
    bool scannerInfo;
} instance_t;
struct node_s *instance_list;

typedef union {
    struct {
        uint32_t buildtargets              : 1;    // 0
        uint32_t settings                  : 1;    // 1
        uint32_t cdtBuildSystem            : 1;    // 2
        uint32_t scannerConfiguration      : 1;    // 3
        uint32_t LanguageSettingsProviders : 1;    // 4
    } bits;
    uint32_t dword;
} cproject_has_t;

typedef union {
    struct {
        uint64_t configurationDataProvider                   : 1;    // 0
        uint64_t settings                                    : 1;    // 1
        uint64_t externalSettings                            : 1;    // 2
        uint64_t core_externalSettings                       : 1;    // 3
        uint64_t extensions                                  : 1;    // 4
        uint64_t folderInfo                                  : 1;    // 5
        uint64_t GASErrorParser                              : 1;    // 6
        uint64_t GmakeErrorParser                            : 1;    // 7
        uint64_t CWDLocator                                  : 1;    // 8
        uint64_t GCCErrorParser                              : 1;    // 9
        uint64_t GLDErrorParser                              : 1;    // 10
        uint64_t targetPlatform                              : 1;    // 11
        uint64_t builder                                     : 1;    // 12
        uint64_t internal_toolchain_type                     : 1;    // 13
        uint64_t internal_toolchain_version                  : 1;    // 14
        uint64_t option_target_mcu                           : 1;    // 15
        uint64_t option_target_cpuid                         : 1;    // 16
        uint64_t option_target_coreid                        : 1;    // 17
        uint64_t option_target_board                         : 1;    // 18
        uint64_t tool_assembler                              : 1;    // 19
        uint64_t tool_assembler_option_debuglevel            : 1;    // 20
        uint64_t tool_assembler_input                        : 1;    // 21
        uint64_t tool_c_compiler                             : 1;    // 22
        uint64_t tool_c_compiler_option_debuglevel           : 1;    // 23
        uint64_t tool_c_compiler_option_optimization_level   : 1;    // 24
        uint64_t tool_c_compiler_option_definedsymbols       : 1;    // 25
        uint64_t tool_c_compiler_option_includepaths         : 1;    // 26
        uint64_t tool_c_compiler_input_c                     : 1;    // 27
        uint64_t tool_cpp_compiler                           : 1;    // 28
        uint64_t tool_cpp_compiler_option_debuglevel         : 1;    // 29
        uint64_t tool_cpp_compiler_option_optimization_level : 1;    // 30
        uint64_t tool_c_linker                               : 1;    // 31
        uint64_t tool_c_linker_option_script                 : 1;    // 32
        uint64_t tool_c_linker_input                         : 1;    // 33
        uint64_t tool_cpp_linker                             : 1;    // 34
        uint64_t tool_cpp_linker_option_script               : 1;    // 35
        uint64_t tool_archiver                               : 1;    // 36
    } bits;
    uint64_t dword;
} cconfiguration_has_t;

cproject_has_t cproject_has;

typedef enum {
    /*  0 */ CPROJECT_STATE_NONE = 0,
    /*  1 */ CPROJECT_STATE_CPROJECT,
    /*  2 */ CPROJECT_STATE_STORAGEMODULE_SETTINGS,
    /*  3 */ CPROJECT_STATE_STORAGEMODULE_CDTBUILDSYSTEM,
    /*  4 */ CPROJECT_STATE_STORAGEMODULE_SCANNERCONFIGURATION,
    /*  5 */ CPROJECT_STATE_EXTENSIONS,
    /*  6 */ CPROJECT_STATE_CONFIGURATION,
    /*  7 */ CPROJECT_STATE_FOLDERINFO,
    /*  8 */ CPROJECT_STATE_TOOLCHAIN_EXE,
    /*  9 */ CPROJECT_STATE_SOURCEENTRIES,
    /*  9 */ CPROJECT_STATE_TOOL_ASSEMBLER,
    /* 10 */ CPROJECT_STATE_TOOL_ASSEMBLER_OPTION_DEBUGLEVEL,
    /* 11 */ CPROJECT_STATE_TOOL_ASSEMBLER_INPUT,
    /* 12 */ CPROJECT_STATE_TOOL_C_COMPILER,
    /* 13 */ CPROJECT_STATE_TOOL_C_COMPILER_OPTION_DEBUGLEVEL,
    /* 14 */ CPROJECT_STATE_TOOL_C_COMPILER_OPTION_OPTIMIZATION_LEVEL,
